let heroes = [

    {
        filmName: "Звёздыный войны",
        name: "Дарт Вейдер",
        info: "Дарт Ве́йдер (англ. Darth Vader, 42 ДБЯ — 4 ПБЯ), также известный под своим настоящим именем как Э́накин Скайуо́кер (англ. Anakin Skywalker) — центральный персонаж первых шести эпизодов саги «Звёздные войны». Также появляется в фильме «Изгой-один». В киноэпопее «Звёздные войны» демонстрируются его становление в качестве рыцаря-джедая, его переход на Тёмную сторону Силы и его итоговое искупление. Отец Люка Скайуокера и Леи Органы. Единственный персонаж, появляющийся в шести эпизодах и спин-оффе «Изгой-один» «во плоти».",
        maker: ["Джордж Лукас","https://ru.wikipedia.org/wiki/Лукас,_Джордж"],
        actor: ["Мэтт Лантер","https://ru.wikipedia.org/wiki/Лантер,_Мэтт"],
        film: "https://www.kinopoisk.ru/film/6695/",
    },
    {
        filmName: "Гарри Поттер",
        name: "Волан-де-Морт",
        info: "Лорд Во́лан-де-Мо́рт (англ. Lord Voldemort — Лорд Волдеморт; имя при рождении — Том Ма́рволо Реддл, англ. Tom Marvolo Riddle) — персонаж серии романов о Гарри Поттере, главный антагонист. Великий тёмный волшебник, обладающий большой магической силой и практически достигший бессмертия при помощи крестражей.\n\nЛорд Волан-де-Морт упоминается во всех книгах, а в фильмах его играют Ричард Бреммер (флэшбек в первом фильме), Ян Харт (лицо на затылке профессора Квиррелла), Кристиан Коулсон (16-летний Том Реддл во втором фильме), Рэйф Файнс (восставший Волан-де-Морт, основное обличье с конца четвёртого фильма до конца киносерии), Хиро Файнс-Тиффин (11-летний Том в воспоминаниях Дамблдора в шестом фильме) и Фрэнк Диллэйн (16-летний Том в воспоминании Слизнорта в шестом фильме).",
        maker: ["Джоан Роулинг","https://ru.wikipedia.org/wiki/Роулинг,_Джоан"],
        actor: ["Рэйф Файнс","https://ru.wikipedia.org/wiki/Файнс,_Рэйф"],
        film: "https://www.kinopoisk.ru/film/689/",
    },
    {
        filmName: "Бэтмен",
        name: "Джокер",
        info: "Джо́кер (c англ. Joker — шутник, балагур) — суперзлодей вселенной DC Comics, главный и заклятый враг Бэтмена. Джокер носит фиолетовый костюм и сражается при помощи предметов, которые стилизованы под реквизит клоуна и иллюзиониста.",
        maker: ["Боб Кейн","https://ru.wikipedia.org/wiki/Кейн,_Боб"],
        actor: ["Хит Эндрю Ле́джер","https://ru.wikipedia.org/wiki/Леджер,_Хит"],
        film: "https://www.kinopoisk.ru/film/4205/",
    },
    {
        filmName: "Шерлок Холмс",
        name: "Джим Мориарти",
        info: "Джеймс «Джим» Мориарти — единственный в мире преступник-консультант, заклятый враг Шерлока Холмса, столь же непревзойденного консультирующего детектива.\n\nДжим управляет преступниками, как марионетками. Все злодеи, встретившиеся Шерлоку в первом сезоне, были так или иначе связаны с таинственным Мориарти.",
        maker: ["Артур Конан Дойл","https://ru.wikipedia.org/wiki/Дойл,_Артур_Конан"],
        actor: ["Эндрю Скотт","https://ru.wikipedia.org/wiki/Скотт,_Эндрю"],
        film: "https://www.kinopoisk.ru/series/502838/",
    },
    {
        filmName: "Мстители: Война бесконечности",
        name: "Танос",
        info: "Танос (англ. Thanos) — персонаж, титан, суперзлодей вселенной комиксов Marvel. Дебютировал в бронзовом веке комиксов в комиксе Iron Man № 55 (1973) и был создан писателем-художником Джимом Старлином. Имя персонажа является выводом из имени Танатос, олицетворения смерти в греческой мифологии. Танос появлялся во многих продуктах Marvel Comics, в том числе в анимационных фильмах, компьютерных играх, фильмах и игрушках.\n\nПерсонаж появился в Кинематографической вселенной Marvel, сыгранный Дэмионом Пуатье в «Мстителях» (2012) и Джошем Бролином в «Стражах галактики» (2014), «Мстители: Эра Альтрона» (2015), «Мстители: Война бесконечности» (2018) и «Мстители: Финал» (2019) с помощью голоса и захвата движения.",
        maker: ["Джим Старлин","https://en.wikipedia.org/wiki/Jim_Starlin"],
        actor: ["Джош Бролин","https://ru.wikipedia.org/wiki/Бролин,_Джош"],
        film: "https://www.kinopoisk.ru/film/843649/",
    },
    {
        filmName: "Матрица",
        name: "Агент Смит",
        info: "Агент Смит — компьютерная программа ИИ, автономный модуль-агент в Матрице, изначально защищающий Матрицу вместе с Агентом Брауном и Агентом Джонсом. Смит проявляет свою физическую форму захватывая и перезаписывая проекцию любого человека, подключенного в Матрице. Он одет в строгий тёмно-зелёный костюм и прямоугольные чёрные очки, носит наушник внутренней связи, который позволяет агентам мгновенно общаться друг с другом и воспринимать действия других людей, подключенных к Матрице, через тип общего сознания. В начале второй части «Матрицы» присылает свой наушник Нео, что символизирует отделение Смита от Матрицы. Также после отделения Смит отличается от остальных агентов: носит костюм чёрного цвета, а также более округлые очки.\n\nВ отличие от других агентов, которые проявляют апатию к человеческому роду, Смит питает острое отвращение к человечеству за его слабость и несовершенство. Когда Смит разговаривает с Морфеусом, он отправляет других агентов из комнаты, затем снимает наушник, освобождая себя от связи с машинами, прежде чем выразить свое мнение о человечестве. Смит жалуется Морфеусу, что Матрица и ее обитатели пахнут отвратительно, «если есть такая вещь [как запах]». Смит сравнивает людей с вирусами, ибо они неизбежно разрушают экосистемы, если бы не машинный интеллект, контролирующий их. По иронии судьбы, Смит в конечном итоге сам становится вирусом, размножаясь до тех пор, пока не заполнит всю Матрицу. Смит отрицает свободу как метафизическое понятие. Всё обусловлено, в том числе целями и намерениями.\n\nВ то же время Смит развивает враждебность по отношению к самой Матрице, чувствуя, что он такой же её пленник, как и люди, которыми ему поручено управлять. Во втором и третьем фильме он представляет собой угрозу как людям Зиона (проникнув в теле Бэйна в реальный мир) — олицетворяющим свободу, правду и любовь, так и царству машин — олицетворяющим ограничения, диктатуру и войну.\n\nВ отличие от других агентов, по одному разу в каждом из фильмов он называет Избранного по имени «Нео». В первом фильме — просматривая досье, во втором — передавая жучок, в третьем — во время виде́ния. В остальных случаях он называет его так, как его называли до пробуждения и только в мире Матрицы — Мистер Андерсон.",
        maker: ["Сёстры Вачовски","https://ru.wikipedia.org/wiki/Сёстры_Вачовски"],
        actor: ["Хьюго Уивинг","https://ru.wikipedia.org/wiki/Уивинг,_Хьюго"],
        film: "https://www.kinopoisk.ru/film/301/",
    },
    {
        filmName: "Человек-паук 3: Враг в отражении",
        name: "Веном",
        info :"Клинтарцы, как называют сами себя симбиоты, происходят от планеты с тем же именем в Галактике Андромеды и являются доброжелательным видом, помогающим другим, создавая героев в процессе привязки к нравственно и физически идеальным хозяевам. Но страдающие от химического дисбаланса или культурной злокачественности носители могут испортить симбиотов как деструктивных паразитов, которые сражаются с их альтруистическими братьями, распространяя дезинформацию среди сородичей и других рас. В итоге прочие обитатели галактики боялись и ненавидели этот вид вцелом.\n\nЗлобные клинтарцы стали более распространёнными, чем их доброжелательные братья, создав культуру космического пространства, предназначенную для заражения планет. Злобные клинтарцы заставляют своих хозяев совершать смертоносные подвиги, чтобы получать адреналин и другие гормоны, такие как фенилэтиламин, до тех пор, пока существа-хозяева не будут высосаны досуха, измученные постоянным стрессом и напряжением, или просто не умрут в опасной ситуации.\n\nПервый хозяин симбиота, ныне известного, как Веном, был злым. Он использовал его для геноцида его планеты, после чего симбиот стал злым паразитом. В какой-то момент симбиот был захвачен и вооружён инопланетным торговцем оружием Haze Mancer, который дозировал на нём химикаты для усиления агрессии и кровожадности. Однако симбиот в итоге сбежал от него.\n\nВеном считался сумасшедшим по мнению его сородичей, так как он стремился, подобно мирным клинтарцам, к взаимной связи с хозяином, а не к господству над ним. В связи с этим он был помещён в тюремную капсулу и, предположительно, приговорён к смерти через разложение.",
        maker: ["Тодд Макфарлейн","https://ru.wikipedia.org/wiki/Макфарлейн,_Тодд"],
        actor: ["Тофер Грейс","https://ru.wikipedia.org/wiki/Грейс,_Тофер"],
        film: "https://www.kinopoisk.ru/film/82441/cast/",
    },
    {
        filmName: "Звёздыный войны",
        name: "Люк Скайуокер",
        info: "Люк Скайуокер (англ. Luke Skywalker) — один из главных персонажей вселенной «Звёздных войн», джедай, сын сенатора с Набу Падме Амидалы Наберри и рыцаря-джедая Энакина Скайуокера. Старший брат-близнец Леи Органы Соло. В оригинальной трилогии и трилогии-сиквеле в роли Люка снялся Марк Хэмилл.\n\nРодился в медицинском центре Полис-Масса в день создания Галактической Империи. После смерти его матери Люка отправили на Татуин к сводному брату Энакина Оуэну Ларсу, чтобы спрятать от Палпатина. На этой планете, под присмотром опекунов и магистра Оби-Вана Кеноби, Люк провёл своё детство. Соединился с Силой в фильме «Последние Джедаи».\n\nВ его честь назван кратер Скайуокер на Хароне (название пока не утверждено Международным астрономическим союзом).",
        maker: ["Джордж Лукас","https://ru.wikipedia.org/wiki/Лукас,_Джордж"],
        actor: ["Марк Ричард Хэмилл","https://ru.wikipedia.org/wiki/Хэмилл,_Марк"],
        film: "https://www.kinopoisk.ru/film/6695/",
    },
    {
        filmName: "Гарри Поттер",
        name: "Гарри Поттер",
        info: "Га́рри Джеймс По́ттер (англ. Harry James Potter) — литературный персонаж, главный герой серии романов английской писательницы Джоан Роулинг.\nНа одиннадцатый день рождения, Гарри узнаёт, что является волшебником и ему уготовано место в школе волшебства «Хогвартс», в которой он будет практиковать магию под руководством директора Альбуса Дамблдора и других школьных профессоров. Также Гарри обнаруживает, что он уже известен во всём магическом сообществе романа, и что его судьба связана с судьбой Волан-де-Морта, опасного тёмного мага, убившего среди прочих и его родителей — Лили и Джеймса Поттер.\nПерсонаж приобрёл большую популярность во всём мире.\n",
        maker: ["Джоан Роулинг","https://ru.wikipedia.org/wiki/Роулинг,_Джоан"],
        actor: ["Дэниел Рэдклифф","https://ru.wikipedia.org/wiki/Рэдклифф,_Дэниел"],
        film: "https://www.kinopoisk.ru/film/689/",
    },
    {
        filmName: "Бэтмен",
        name: "Бэтмен",
        info: "Бэ́тмен (англ. Batman), изначально Бэт-мен (англ. Bat-man «Человек — летучая мышь») — супергерой, персонаж комиксов издательства DC Comics, впервые появившийся в Detective Comics («Детективные комиксы») № 27 30 марта 1939 года, Бэтмен является одним из самых популярных и известных героев комиксов. Был создан художником Бобом Кейном в соавторстве с писателем Биллом Фингером. До недавнего времени Боб Кейн считался главным создателем персонажа, но в 2015 году, после множества исследований, авторство было передано Биллу Фингеру, так как настоящий вклад Кейна в создание героя оказался весьма незначительным.\nВ оригинальной версии биографии Бэтмен — тайное альтер-эго миллиардера Брю́са Уэ́йна, успешного промышленника, филантропа и любимца женщин. В детстве, став свидетелем убийства своих родителей, Брюс поклялся посвятить свою жизнь искоренению преступности и борьбе за справедливость. Подготовив себя физически и морально, он надевает стилизованный костюм летучей мыши и выходит на улицы города для противостояния преступникам. Место действия историй о Бэтмене — вымышленный американский город Готэм, созданный на основе Чикаго с элементами Нью-Йорка. При содействии нескольких второстепенных персонажей, в том числе своего напарника Робина, дворецкого Альфреда, комиссара полиции Джеймса Гордона, а также иногда супергероинь Бэтгёрл и Бэтвумен, Бэтмен противостоит преступному сообществу, коррумпированным политикам и продажным представителям власти Готэма, а также группе злодеев, среди которых Джокер, Двуликий, Ядовитый Плющ, Пингвин. В отличие от большинства супергероев, Бэтмен не обладает сверхспособностями, а использует свой высокий интеллект, различные навыки боевых искусств, познания в науке и технике, а также несгибаемую волю, способность внушать страх и запугивать своих врагов. В отличие от преступников, которым он противостоит, Бэтмен никогда никого не убивает и никогда никому не мстит.\nПочти сразу после своего появления Бэтмен обрёл популярность; меньше чем через год он получил собственную одноимённую серию комиксов. С течением времени появилось несколько вариантов различного толкования персонажа. После выхода телесериала «Бэтмен» в 1966 году образ Бэтмена, воплощённый актёром Адамом Уэстом, использовался в комиксах на протяжении многих лет. В 1980-х годах было решено вернуть более зловещий вид Тёмного рыцаря, что отражено в мини-серии комиксов 1986 года Batman: The Dark Knight Returns (рус. Бэтмен: Возвращение Тёмного рыцаря) авторства Фрэнка Миллера. Образ, переписанный Миллером, стал основой для фильма Тима Бёртона «Бэтмен» 1989 года и перезапуска 2005 года «Бэтмен: Начало» режиссёра Кристофера Нолана, которые позволили возродить популярность персонажа. Как культурная икона Бэтмен был адаптирован для кино, телевидения и книг, а также появляется в различных видах товаров, продающихся по всему миру, таких как видеоигры, игрушки и одежда. В настоящее время Бэтмен входит в тройку величайших супергероев (вместе с Суперменом и Человеком-Пауком), занимая 2 место в списке «Сто лучших героев комиксов всех времён» по версии IGN.\n",
        maker: ["Боб Кейн","https://ru.wikipedia.org/wiki/Кейн,_Боб"],
        actor: ["Бен Аффлек","https://ru.wikipedia.org/wiki/Аффлек,_Бен"],
        film: "https://www.kinopoisk.ru/film/4205/",
    },
    {
        filmName: "Шерлок Холмс",
        name: "Шерлок Холмс",
        info: "Ше́рлок Холмс (англ. Sherlock Holmes [ ˈʃɜː(r)lɒk ˈhəʊmz] Информация о файле слушать) — литературный персонаж, созданный Артуром Конаном Дойлом. Произведения Конана Дойла, посвящённые приключениям Шерлока Холмса, знаменитого лондонского «консультирующего» детектива, стали классикой детективного жанра. Прототипом Холмса считается доктор Джозеф Белл (Dr. Joseph Bell), сослуживец Конана Дойла, работавший в Эдинбургском королевском госпитале и славившийся способностью по мельчайшим деталям угадывать характер, занятия и прошлое человека.\n\nШерлок Холмс, умный, благородный и справедливый борец со злом и защитник обиженных, стал всемирной культовой фигурой и персонажем фольклора. В разных странах существуют десятки посвящённых ему обществ, музеев и памятников, почитатели пишут ему письма, романисты сочиняют продолжения его приключений, а книга рекордов Гиннесса называет Холмса «самым экранизируемым литературным героем». Гилберт Честертон назвал Холмса «единственным литературным персонажем со времён Диккенса, который прочно вошёл в жизнь и язык народа, став чем-то вроде Джона Булля или Санта-Клауса».",
        maker: ["Артур Конан Дойл","https://ru.wikipedia.org/wiki/Дойл,_Артур_Конан"],
        actor: ["Бенедикт Камбербэтч","https://ru.wikipedia.org/wiki/Камбербэтч,_Бенедикт"],
        film: "https://www.kinopoisk.ru/series/502838/",
    },
    
    {
        filmName: "Мстители",
        name: "Тони Старк",
        info: "Железный человек (англ. Iron Man); настоящее имя — Энтони Эдвард «Тони» Старк (англ. Anthony Edward 'Tony' Stark) — персонаж, изданий Marvel Comics и их адаптаций, созданный писателем Стэном Ли, сценаристом Ларри Либером и художниками Доном Хэком[en] и Джеком Кёрби; первое появление Железного человека состоялось в комиксе Tales of Suspense #39 в марте 1963 года.\n\nВ первоначальном варианте своей биографии Тони Старк, гениальный изобретатель, муж Верналии Лодж и богатейший промышленник с репутацией плейбоя, страдает от ранения, полученного им в плену, где его вынудили разработать для террористов оружие массового поражения. Вместо этого он создаёт высокотехнологичный костюм-броню, с помощью которого сбегает из плена. Позднее Старк улучшает свою броню вооружением и устройствами, созданными на базе ресурсов его компании, и использует доспех, чтобы защищать мир в облике Железного человека, первое время скрывая свою личность.Перейти к разделу «#Биография»\n\nПервоначально Железный человек, будучи порождением Холодной войны и Вьетнамской войны, в частности, был для Стэна Ли средством раскрытия их соответствующих тем и роли американской экономики в борьбе с коммунизмом; со временем в последующих переосмыслениях образа упор стал делаться на проблемы корпоративного криминала и терроризма.Перейти к разделу «#История публикаций»\n\nНа протяжении времени публикаций Железный человек связан в первую очередь с командой Мстителей, будучи одним из её сооснователей, и нескольких побочных от неё команд супергероев; его сольная серия, запущенная в мае 1968 года, пережила 5 томов, издаваясь с перерывом в 2008—2012 годах, когда её сменила серия The Invincible Iron Man, вплоть до 2014 года. Впоследствии, с ростом популярности, Железный человек стал персонажем нескольких мультсериалов и мультфильмов, причём как сольных, так и в составе Мстителей. В фильмах, относящихся к кинематографической вселенной Marvel, его роль играет актёр Роберт Дауни-младший.",
        maker: ["Стэн Ли","https://ru.wikipedia.org/wiki/Ли,_Стэн"],
        actor: ["Роберт Дауни-младший","https://ru.wikipedia.org/wiki/Дауни,_Роберт_(младший)"],
        film: "https://www.kinopoisk.ru/film/843649/",
    },
    {
        filmName: "Матрица",
        name: "Нео",
        info: "Нео, программист, живёт в мире Матрицы, иллюзорной реальности, симулирующей конец XX века. Люди были подключены к Матрице, чтобы полностью контролироваться восставшими машинами, использующими людей для себя как источник энергии.\n\nТе, кто подсоединены к Матрице, не понимают, что реальность вокруг них на самом деле нереальна. Однако «свободными» людьми, не подключёнными к Матрице, было организовано сопротивление, которое время от времени отключает определённых людей от Матрицы посредством сложной процедуры.\n\nСреди них бытует легенда или пророчество о том, что существует человек, который сможет контролировать Матрицу, изменять её законы под себя. В мифе этого человека называют «Избранный». Он стал целью поиска, которым задался Морфеус, капитан одного из кораблей Зиона.\n\nНео становится этим избранным и освобождает человечество от рабства, закончив войну с машинами.\n\nСлово «Нео» (англ. Neo) является анаграммой слова «One» (с англ. — «Избранный»), а с латинского и греческого переводится как «Новый».",
        maker: ["Сёстры Вачовски","https://ru.wikipedia.org/wiki/Сёстры_Вачовски"],
        actor: ["Киану Ривз","https://ru.wikipedia.org/wiki/Ривз,_Киану"],
        film: "https://www.kinopoisk.ru/film/301/",
    },

    {        
        filmName: "Человек-паук",
        name: "Человек-паук",
        info: "Корпорация «Дженерал Тектроникс» (General Techtronics) проводила выставку по безопасному обращению с радиацией, и Питер, как настоящий любитель науки, просто не мог её пропустить. На выставке его укусил паук, облучившийся радиацией в ускорителе элементарных частиц. По дороге домой Питер обнаружил, что он каким-то образом получил невероятную силу, ловкость и способность держаться на стенах, и сразу же понял, что это связано с укусом паука.\n\nУвидев объявление, предлагающее денежный приз любому, кто продержится три минуты на ринге с профессиональным рестлером, Питер решил, что это хороший способ проверить свои силы. Чтобы избежать стыда в случае поражения, он соорудил себе маску. Паркер легко победил противника и был замечен телевизионным продюсером, который убедил его устроиться работать на телевидении. Сшив яркий костюм и сконструировав контейнеры, стреляющие паутиной, Питер назвался Человеком-Пауком и немедленно стал сенсацией.\n\nПосле своего выступления на телевидении Питер отказался остановить вора, сказав, что это не его дело. Пит забыл об этом случае и продолжил купаться в лучах славы. Однажды вечером, вернувшись домой, он обнаружил, что дядя Бен был убит. Узнав от полиции, что преступник загнан в угол на старом складе, Питер отправился туда и легко победил его. Когда лицо преступника попало в лучи света, Паркер узнал в нём того самого грабителя, которого однажды отказался задержать. Переполненный угрызениями совести, Питер осознал, что с великой силой приходит великая ответственность. Вскоре он начал блестящую карьеру борца с преступностью в качестве Удивительного Человека-Паука.",
        maker: ["Стэн Ли","https://ru.wikipedia.org/wiki/Ли,_Стэн"],
        actor: ["Тоби Магуайр","https://ru.wikipedia.org/wiki/Магуайр,_Тоби"],
        film: "https://www.kinopoisk.ru/film/838/",
    },
]

let subTitles = [
    "Злодеи",
    "Герои"
]

let souvenirsList = [
    {
        id: "0",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "1",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "2",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "3",
        array: [
            {
                price: "400₽",
                text: "Чехольчик для айфончика",
                img: "url('../souvenirs/souvenirs_img/5_0.png')",
            },
            {
                price: "500₽",
                text: "Кружечка",
                img: "url('../souvenirs/souvenirs_img/5_1.jpg')",
            },
            {
                price: "200₽",
                text: "Блокнотик",
                img: "url('../souvenirs/souvenirs_img/5_2.png')",
            },
            {
                price: "800₽",
                text: "Футболочка",
                img: "url('../souvenirs/souvenirs_img/5_3.jpg')",
            },
            {
                price: "200₽",
                text: "Блокнотик",
                img: "url('../souvenirs/souvenirs_img/5_4.png')",
            },
            {
                price: "1000₽",
                text: "Футболочка",
                img: "url('../souvenirs/souvenirs_img/5_5.png')",
            },
            {
                price: "600₽",
                text: "Коврик для мышуи",
                img: "url('../souvenirs/souvenirs_img/5_6.jpg')",
            },
            {
                price: "500₽",
                text: "Кружечка",
                img: "url('../souvenirs/souvenirs_img/5_7.jpg')",
            },
            {
                price: "150₽",
                text: "Магнитик",
                img: "url('../souvenirs/souvenirs_img/5_8.jpg')",
            },
            {
                price: "1500₽",
                text: "Худи",
                img: "url('../souvenirs/souvenirs_img/5_9.jpg')",
            },
            {
                price: "800₽",
                text: "Часы",
                img: "url('../souvenirs/souvenirs_img/5_10.jpg')",
            },
            {
                price: "500₽",
                text: "Чехольчики для паспорт",
                img: "url('../souvenirs/souvenirs_img/5_11.jpg')",
            },
            {
                price: "700₽",
                text: "Футболочка",
                img: "url('../souvenirs/souvenirs_img/5_12.jpg')",
            },
            {
                price: "500₽",
                text: "Кружечка",
                img: "url('../souvenirs/souvenirs_img/5_13.jpg')",
            },
        ]
    },
    {
        id: "4",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "5",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "6",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "7",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "8",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "9",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "10",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "11",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "12",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "13",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },
    {
        id: "14",
        array: [
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
            {
                price: "",
                text: "",
                img: "",
            },
        ]
    },

]

let pairsList = [
    ['Дарт Вейдер', 'Люк Скайуокер'],
    ['Гарри Поттер', 'Волан-де-Морт'],
    ['Бэтмен', 'Джокер'],
    ['Шерлок Холмс', 'Мориарти'],
    ['Танос', 'Железный человек'],
    ['Нео', 'Смит'],
    ['Человек-паук', 'Веном'],
]

let pairInfoList = [
    {
        id:0,
        array:[
            ["1. Дарт Вейдер – дитя Силы","images_pair/0_0.webp","Дарт Вейдер впервые появился в «Звездных войнах» 1977 года , но на самом деле он родился за четыре десятилетия до событий этого фильма как Энакин, ребенок рабыни по имени Шми Скайуокер. Спустя много лет после его рождения Шми сказала мастеру-джедаю Куай-Гону Джинну, что у Энакина «отца не было», что привело Куай-Гона к выводу, что Энакин был зачат сущностями Силы, известными как мидихлорианы. Хотя это не было окончательно заявлено, но в значительной степени подразумевает, что зачатие Энакина было каким-то образом вызвано манипуляциями Темной стороны Силы от Лорда Ситхов Дарта Плэгаса и его ученика Дарта Сидиуса.\n\nМолодой Энакин с самого раннего возраста демонстрировал потрясающие умственные способности и мастерство и был настолько искусен в механике и ремонте, что начал работать на хозяина своей матери Уотто в мастерской на Татуине. Инженерные навыки Энакина были настолько развиты, что он начал создавать протокольного дроида C-3PO для своей матери, прежде чем ему исполнилось десять лет.\n\nКроме того, он был искусным гонщиком, что было редкостью, поскольку человеческие рефлексы обычно были слишком медленными, чтобы позволить им выжить в этом виде спорта.\n\nОднако спокойная рабская жизнь Энакина была нарушена, когда в возрасте девяти лет он впервые встретил пару рыцарей-джедаев."],
            ["2. Энакин – Избранный","images_pair/0_1.webp","Во время миссии по сопровождению королевы Набу Падме Амидалы из ее родного мира в столицу Республики Корусант, мастер-джедай Куай-Гон Джинн и его ученик Оби-Ван Кеноби столкнулись с Энакином в магазине Уотто, когда искали запчасти для своего звездолета. Куай-Гон сразу же заинтересовался Энакином и проверил его уровень мидихлорианов, обнаружив, что он зашкаливает. Убежденный в способности Энакина стать джедаем, Куай-Гон заключил пари с Уотто, что мальчик может выиграть свою свободу в гонке. Энакин выиграл гонку и сопровождал Куай-Гона и Оби-Вана на Корусант, но он оплакивал необходимость оставить свою мать.\n\nКуай-Гон представил Энакина Высшему совету джедаев, убежденный, что мальчик может быть тем избранным, который принесет равновесие в Силу, но мастера Йода и Винду опасались возраста Энакина и его пугающего поведения после разлуки с матерью. Куай-Гон умолял дать ему возможность обучать его в любом случае.\n\nВ битве за Набу против Торговой федерации Энакин пилотировал истребитель, доказав, что его навыки выходят за рамки гонок на карах. После того, как битва закончилась, он обнаружил, что Куай-Гон пал от руки Дарта Мола, и Оби-Ван дал клятву обучать Энакина в соответствии с волей его наставника. Высший совет согласился, и Энакин стал джедаем-падаваном."],
            ["3. Страх ведёт к гневу, и история начинает темнеть","images_pair/0_2.webp","Следующие десять лет Энакин провел в качестве ученика Оби-Вана и показал себя чрезвычайно искусным джедаем, который также имел склонность к безрассудству. Кроме того, он продолжал испытывать гнев, вспоминая, что случилось с его матерью в его отсутствие. Будучи молодым человеком, он соединился с тогдашним сенатором Падме Амидалой на Корусанте, когда ему и Оби-Вану было поручено охранять ее жизнь после покушения.\n\nПока Оби-Ван пытался выследить людей, стоящих за покушением на жизнь Падме, Энакин остался в качестве ее личного телохранителя и сопровождал ее обратно на Набу. Сенатор и джедай вскоре полюбили друг друга, но более темные наклонности Энакина выходили на поверхность, когда его мучили видения о его матери. Вместе с Падме Энакин отправился на Татуин, где узнал, что теперь вышедшая замуж и освобожденная Шми Скайуокер была похищена тускенскими рейдерами.\n\nЭнакин выследил племя тускенов и свою мать, которая умерла у него на руках, увидев его в последний раз. В ярости Скайуокер перебил все племя и поклялся Падме, что станет достаточно могущественным, чтобы предотвратить смерть любимых им людей. Это было началом погружения во тьму, от которого он не оправится еще несколько десятилетий."],
            ["4. Война клонов","images_pair/0_3.webp","После инцидента с тускенскими рейдерами, Энакин и Падме покинули Татуин и отправились на Геонозис, надеясь спасти Оби-Вана, который был взят в плен сепаратистами после того, как узнал, кто нанял убийцу Падме. К сожалению, пара вскоре была схвачена лидером сепаратистов и лордом ситхов графом Дуку и приговорена к смерти, но когда они начали пробиваться к выходу с геонозийской арены, прибыло подкрепление в виде армии клонов. Эти солдаты-клоны были недавно обнаружены Оби-Ваном, и под руководством Йоды и Мэйса Винду они победили сепаратистов. Это стало первым сражением в Войнах клонов.\n\nПоскольку битва все еще продолжалась, Энакин и Оби-Ван вступили с Дуку в поединок на световых мечах, но безрассудство Энакина взяло верх над ним, когда он попытался сразиться с Дуку в одиночку. Ситх победил Энакина, отрубив ему правую руку, но затем был отброшен назад Йодой.\n\nВ последующие дни Энакин получил новую синтетическую руку и вернулся на Набу вместе с Падме. Они поженились тайно – дроиды C-3PO и R2-D2 выступали в качестве свидетелей – потому что Орден джедаев запрещал такие романтические отношения. Возросший страх Энакина потерять тех, кого он любил, вкупе с его пренебрежением правилами джедаев, вскоре создадут дальнейшие трения между молодым джедаем и его начальством."],
            ["5. Ученик Энакина","images_pair/0_4.webp","По мере того, как Войны клонов набирали силу, Энакин получил звание рыцаря-джедая и стал ключевым генералом Республики. Его способности и уверенность в себе росли, но вместе с ними росло и безрассудство, а вместе с ним и страх потерять тех, кого он любил. Стремясь помочь, Йода предположил, что Энакин мог бы научиться отпускать людей, взяв своего собственного ученика, который однажды вознесется за пределы его обучения. Он был в паре с молодым падаваном по имени Асока Тано, и хотя у них изначально были трения из-за вздорной натуры Асоки, в конечном счете они стали друзьями.\n\nПо мере того, как шли войны, Асока росла вместе со своим учителем, становясь уважаемым военным лидером и адептом Силы сама по себе, пока ее не подставили и не арестовали за взрыв в Храме джедаев, который на самом деле был осуществлен одним из ее друзей. Асока была исключена из Ордена джедаев, но Энакин и Падме верили в ее невиновность и в конечном итоге смогли получить доказательства, которые привели к ее оправданию на суде.\n\nХотя ей было предложено вновь вступить в Орден джедаев, Асока разочаровалась после суда, и она решила оставить ремесло джедаев. Наблюдение за обращением с его бывшей ученицей еще больше расстроило Энакина, который сам начинал терять веру в мудрость Высшего совета джедаев."],
            ["6. Возвышение Дарта Вейдера","images_pair/0_5.webp","Растущие способности Энакина и его предполагаемый статус избранного к концу Войн клонов привлекли внимание повелителя ситхов Дарта Сидиуса, который управлял всей войной из-за кулис через свои двойные роли ситха и Шива Палпатина, канцлера Республики. Палпатин, который получил огромную власть благодаря чрезвычайному законодательству военного времени, наконец сделал свой ставку на Скайуокера в последние дни войны, убеждая его хладнокровно убить Дуку в разгар космического сражения над Корусантом.\n\nЭнакин подчинился, обезглавив Дуку, и Палпатин продолжил готовить Энакина в качестве своего ученика, назначив его своим эмиссаром в Совет джедаев. Совет подчинился пожеланиям канцлера, но отказался предоставить Энакину звание магистра, еще больше разжигая его разочарование. Это, вкупе с частыми видениями Падме, которая тогда была беременна, о собственной смерти, заставило Палпатина наконец раскрыться Энакину, убедив его, что он может остановить смерть своих близких, используя Темную сторону Силы.\n\nПротиворечивый Энакин сначала сообщил Совету джедаев, что Палпатин был повелителем ситхов... а потом помог Палпатину убить Мейса Винду в надежде, что Палпатин научит его, как спасти Падме. Огорченный предательством Винду, Энакин покорился своему новому хозяину, который в свою очередь назвал его Дартом Вейдером."],
            ["7. Дарт Вейдер против Оби-Вана Кеноби","images_pair/0_6.webp","Снедаемый страхом потерять Падме и ненавистью к Совету джедаев, который, как он чувствовал, сдерживал его, недавно окрещенный Дарт Вейдер был готов сделать все для своего нового учителя, если бы это означало, что он мог узнать, как спасти Падме. Поэтому Палпатин отправил Вейдера в Храм джедаев в рамках своей программы великой чистки джедаев, где Вейдер жестоко убивал любого сторонника светлой стороны Силы на своем пути, включая юнлингов в храме.\n\nЗатем Вейдер отправился на Мустафар, чтобы убить последних сепаратистов и положить конец искусственно созданной Палпатином войне. Оби-Ван и Падме, узнав о его предательстве, последовали за ним, чтобы остановить его. Разъяренный мыслью, что его старый учитель и жена соединились вместе, чтобы предать его, он использовал Силу, чтобы почти задушить Падме, а затем вызвал Оби-Вана на дуэль. В конце концов, Оби-Ван взял верх в битве, отрубил Вейдеру обе ноги и оставил его умирать рядом с канавой из лавы.\n\nПалпатин отправился на Мустафар, чтобы спасти своего ученика, а затем облачил его в спасающие жизнь доспехи, превратив его в Вейдера-полумашину, которого мы все знаем и любим. Палпатин также сказал Вейдеру, что он случайно убил Падме и их нерожденных детей на Мустафаре. По правде говоря, Падме умерла от разбитого сердца, но не раньше, чем тайно родила детей-близнецов, Люка и Лею, которые были спрятаны от отца, пока росли. Вейдер занял свое место рядом с Палпатином, когда республика стала Галактической империей, хотя он все еще питал желание вернуть Падме любой ценой."],
            ["8. Сила Темной стороны","images_pair/0_7.webp","Прошло два десятилетия. Империя продолжала расти, и Энакин Скайуокер приспособился к своей новой жизни в качестве Дарта Вейдера. Он продолжал свои усилия по искоренению джедаев-изгоев (с помощью имперских инквизиторов), но ему также приходилось иметь дело с планами Палпатина, который желал поощрять его конкурентную природу, привлекая других воинов, которые могли бы заменить Вейдера на стороне Императора. Все это время его доспехи усиливали боль и, следовательно, гнев, делая его сильнее на Темной стороне.\n\nВозможно, самое важное событие этой эпохи произошло, когда Палпатин подарил Вейдеру маску, принадлежащую Момину, древнему повелителю ситхов и художнику, чей дух все еще владел маской. Момин общался с Вейдером, когда тот пытался построить дом над древним локусом Темной стороны на Мустафаре. Сам Момин планировал использовать локус, чтобы с помощью энергии Темной стороны воскресить собственное тело, но его план был сорван, когда он упрекнул Вейдера за его собственные практики темной стороны, и Вейдер ответил, сокрушив воскресшую форму Момина.\n\nЗатем Вейдер использовал врата, открытые Момином, чтобы найти дух Падме и вернуть ее обратно, но вместо этого он обнаружил тьму, когда ее форма распалась перед его глазами. Вейдер пришел к выводу, что Падме и Энакин Скайуокер мертвы, и что его прошлое больше не имеет значения. Однако видение показало ему еще одну вещь – маяк надежды в виде неизвестного молодого человека, с которым он вскоре встретится."],
            ["9. Начало Восстания","images_pair/0_8.webp","В то время как Вейдер преследовал собственные интересы на Темной стороне и продолжал искоренять джедаев-изгоев, сформировалось революционное движение, которое переросло в Альянс повстанцев, группу, которая стремилась вести тотальную войну против Империи. Его последователи были многочисленны и включали Асоку Тано, которую Вейдер вызвал на дуэль, чтобы убить.\n\nВосстание получило неожиданное преимущество через 19 лет после падения Республики, когда повстанцам удалось захватить чертежи боевой станции, разрушающей целые планеты, под названием Звезда Смерти. Вейдер возглавил погоню за мятежниками и сумел захватить одного из их лидеров, принцессу Лею Органу, которая была его давно потерянной дочерью. Гранд-Мофф Таркин, командир Звезды Смерти, заставил Вейдера пытать Лею и даже уничтожить ее приемный дом на Альдераане, когда они пытались добраться до секретной базы мятежников.\n\nЗатем у Вейдера произошла неожиданная встреча со старым другом. Когда небольшая группа, в которую входил Оби-Ван Кеноби, проникла на Звезду Смерти, чтобы спасти Лею, мастер и ученик решили, что пришло время для реванша. К несчастью, Вейдер убил своего старого учителя, но спасение было успешным, и повстанцы использовали планы Звезды Смерти для атаки, в то время как Таркин пытался направить Звезду Смерти в пределы досягаемости недавно обнаруженной базы повстанцев на Явине IV.\n\nВ последовавшем сражении Вейдер едва не остановил уничтожение Звезды Смерти, почти убив пилота повстанцев Люка Скайуокера (его все еще неизвестного, давно потерянного сына). Люка спас в последний момент контрабандист Хан Соло, а истребитель Вейдера отправился в космос после нескольких выстрелов с корабля Соло, «Тысячелетнего сокола»."],
            ["10. История принимает другой оборот, когда Вейдер узнает секрет","images_pair/0_9.webp","Уничтожение Звезды Смерти было главной победой Восстания, но оно также отправило Вейдера на новый путь открытий. После нападения Люк Скайуокер, Лея Органа и Хан Соло отправились на миссию взорвать имперский объект, когда столкнулись с Вейдером. Люк попытался сразиться с повелителем ситхов, и в процессе Вейдер узнал световой меч Люка. В конце концов, именно Оби-Ван Кеноби подарил этот световой меч Энакину много лет назад.\n\nНемного встревоженный, Вейдер использовал своих агентов, включая охотника за головами Бобу Фетта и археолога доктора Афру, чтобы узнать больше. Афра узнала, что Падме действительно родила перед смертью и что ее посмертная беременность была фиктивной, а Фетт узнал, что имя мальчика, который уничтожил Звезду Смерти и сразился с Вейдером, было Скайуокер.\n\nВ этот момент Вейдер понял, что его обманули, и он разорвал свой собственный звездолет на части, услышав новость, что у него действительно есть сын, хотя он еще не знал, что Падме родила близнецов. В соответствии с «правилом двух» ситхов, в котором ученики убивали своих учителей, чтобы самим подняться до уровня мастера, Вейдер начал планировать обратить своего сына на Темную сторону, убить императора и занять его место в качестве правителя галактики."],
            ["11. Дарт Вейдер открывает правду Люку","images_pair/0_10.webp","Прошло три года, пока Вейдер, наконец, не выследил Люка и, следовательно, повстанцев, на скрытой базе на ледяной планете Хот. Империя вторглась на планету, пока повстанцы эвакуировались, и Люк снова вырвался из лап Вейдера. Вскоре Палпатин поделился своими знаниями о Люке Вейдеру, и оба начали работать над тем, чтобы перевести молодого Скайуокера на Темную сторону. Чтобы добиться этого, Вейдер начал кампанию по поиску друзей Люка на борту корабля Соло, «Тысячелетнего сокола», любой ценой. С помощью охотника за головами Бобы Фетта он в конечном итоге захватил Хана и Лею на Беспине и использовал их в качестве приманки, чтобы заманить Люка, который тренировался с изгнанным Йодой на болотной планете Дагоба.\n\nПлан сработал, и Люк прибыл на Беспин, чтобы сразиться с Вейдером и спасти своих друзей. Вейдер победил молодого джедая в поединке на световых мечах, отрубив при этом правую руку Люка. И вот тогда Вейдер решил открыть, что он отец Люка. Люк отказывался верить в это, и вместо того, чтобы присоединиться к Темной стороне, он решил погибнуть. К счастью, он упал в недра горного завода Беспин, где его спасла Лея на «Соколе»."],
            ["12. Энакин Скайуокер искуплен","images_pair/0_11.webp","Вейдер вернулся с Беспина, чтобы наблюдать за строительством второй Звезды Смерти, которую должен был окрестить сам император. Палпатин планировал использовать новое супероружие как приманку, чтобы заманить в ловушку и победить Восстание, сделав его более уязвимым, чем оно было, и в то же время в качестве приманки для Скайуокера, который постепенно продвигался вперед в джедайском мастерстве.\n\nСкайуокер вновь появился на лесистом спутнике Эндора, где он был захвачен Вейдером и отвезен на Звезду Смерти. Теперь Люк полностью осознавал, кем был его отец, и был полон решимости достучаться до сердца Вейдера, так же как Вейдер был полон решимости обратить своего сына. Вейдер привел Скайуокера к Императору, который попытался вызвать гнев в Скайуокере, обнародовав свой план поймать его друзей-повстанцев. В конце концов, гнев ведет к Темной стороне.\n\nВейдер и Люк снова вступили в дуэль, и во время боя Вейдер почувствовал в сознании сына, что у него есть сестра, второй ребенок Вейдера. Используя это знание как рычаг, Вейдер вызвал гнев Люка, и Люк победил Вейдера в поединке. Но за несколько секунд до убийства своего отца Люк понял, что он становится таким же, как Вейдер, поэтому он отбросил оружие в сторону, отказываясь присоединиться к Темной стороне. Это не понравилось Палпатину, который ответил, используя силовую молнию, чтобы убить Люка электрическим током. Видя, как умирает его сын, что-то внезапно переключилось внутри Вейдера. Слабый и израненный, Вейдер сумел бросить своего хозяина в ядро Звезды Смерти, по-видимому убив его.\n\nТяжело раненный молнией Силы Палпатина, Вейдер не мог долго жить. Но с последним вздохом Энакин Скайуокер вернулся с Темной стороны и сказал своему сыну, что он был прав относительно него все время."],
            ["13. Наследие Дарта Вейдера продолжает влиять на историю «Звездных войн»","images_pair/0_12.webp","Пока Вейдер, Палпатин и Люк Скайуокер сражались на Звезде Смерти, альянсу Повстанцев удалось уничтожить боевую станцию, и Люк сбежал с телом своего отца незадолго до взрыва Звезды Смерти. Победа ознаменовала начало конца для Галактической Империи, и положила начало общегалактическому празднованию конца правления Палпатина.\n\nХотя последующие десятилетия были относительно мирными, наследие Вейдера как легенды Темной стороны продолжало жить и снова пустило корни в виде его внука – сына Леи и Хана, Бена Соло. Бен привлек внимание Сноука, могущественного адепта Темной стороны, который взял на себя руководство остатками имперской армии во Внешнем Кольце, превратив их в Первый Орден. Сноук почувствовал потенциал Темной стороны в родословной Скайуокера и попытался развить его в Бене Соло. Он преуспел, и Бен Соло восстал против своего дяди, магистра-джедая Люка Скайуокера, положив конец попыткам Люка восстановить Орден джедаев.\n\nКогда он полностью обратился к Темной стороне, Бен Соло изменил свое имя на Кайло Рен и поклялся закончить»то, что начал Дарт Вейдер: полное уничтожение джедаев. Он принял свой собственный красный световой меч и черный шлем, став преемником Вейдера. На самом деле Кайло даже приобрел старый шлем Вейдера, который был частично сожжен на его погребальном костре. Хотя, возможно, в Кайло Рене еще осталось что-то хорошее, его решимость жить в соответствии с наследием Вейдера ничуть не потускнела."],
        ]
    },
    {
        id:1,
        array:[
            ["Появление Гарри Поттера","images_pair/1_0.jpg","Волан-де-Морт неожиданно узнал от своего верного сторонника Снегга часть пророчества, где говорилось о мальчике, который родится в конце июля и в будущем одолеет Тёмного Лорда. Под описание подходили два младенца: родившийся 30 июля 1980 года Невилл Долгопупс и появившийся на свет днём позже Гарри Поттер. Волан-де-Морт решил, что в пророчестве говорилось о втором мальчике, и решает убить его, пока тот ещё в колыбели. Однако в ночь на 31 октября 1981 года Волан-де-Морту не удалось убить Гарри из-за того, что мать Гарри не отошла с дороги, как ей предлагал Волан-де Морт, и тем самым добровольно принесла себя в жертву ради сына, дав ему древнюю жертвенную материнскую защиту. Заклинание Авада Кедавра отрикошетило от мальчика и попало в Волан-де-Морта. При этом часть души Тёмного Лорда откололась и проникла в Гарри. Так Гарри стал шестым крестражем."],
            ["Попытки возвращения","images_pair/1_1.jpg","Волан-де-Морт ушёл в леса Албании. Там он скрывался до 1991 года, постоянно пытаясь вернуть себе тело и магическую силу. Но ему это не удавалось: бестелесному Тёмному Лорду нужна была помощь, а бывшие соратники либо сидели в Азкабане, либо наслаждались мирной жизнью, успешно доказав свою непричастность к преступлениям Волан-де-Морта. Максимум, на что сейчас хватало сил Тому Реддлу — это овладеть телом какой-нибудь мелкой зверюшки, но и та быстро погибала.\n\nНаконец Волан-де-Морту повезло: в его леса забрёл Квиринус Квиррелл — молодой преподаватель Хогвартса. Молодой, доверчивый, наивный. Как раз такой, которого легко взять под контроль, и который будет выполнять все указания Хозяина. Квиррелл привозит Тёмного Лорда в Лондон, где пытается похитить из Гринготтса философский камень.\n\nПосле неудачи (как раз за пару часов до этого Рубеус Хагрид забрал камень) Волан-де-Морт вселяется в Квиррелла, чтобы самолично присматривать за слугой. Однако в конце учебного года, когда первокурсник Гарри Поттер увидел истинное обличье профессора, Квиррелл сгорел от руки Гарри (сработала защита крови матери) и Волан-де-Морт покинул его тело. Он возвратился в своё прежнее укрытие.\n\nНезадолго до гибели тела Волан-де-Морт доверил свой первый крестраж — дневник — Люциусу Малфою. Однако честолюбивый Малфой решил занять кресло директора Хогвартса, а заодно — опозорить семью своего давнего недруга Артура Уизли. Не зная о том, что это крестраж, Малфой подсунул дневник дочери Артура, Джинни. Девочка, вкладывая свою душу в дневник, постепенно слабела, а Реддл-из-дневника набирал силу. В конце учебного года он уже вышел из дневника и едва не погубил Джинни. Однако Гарри Поттер в очередной раз схватился с юным Волан-де-Мортом и уничтожил дневник. Так Тёмный Лорд вновь потерпел фиаско."],
            ["Возрождение","images_pair/1_2.jpg","В течение 1993-1994 годов Волан-де-Морт по-прежнему скрывался в лесах Албании. Но в 1994 году к нему добрался его трусоватый слуга Питер Петтигрю, который начал помогать ему в подготовке к обряду возрождения.\n\nВолан-де-Морт, составляя очередной маниакальный план, включил в него и своего заклятого врага — подросшего к тому времени Гарри Поттера. Для этого он послал в Хогвартс своего верного слугу Барти Крауча-младшего, а сам, заняв дом отца в Литтл-Хэнглтоне (того самого отца, которого убил в шестнадцатилетнем возрасте), начал набираться сил. С помощью змеи Нагайны[20] и различных зелий, которые готовил для него Петтигрю, он укреплял своё хлипкое тельце, в котором влачил на тот момент своё жалкое существование. В это же время он создаёт последний крестраж — помещает часть своей души в змею Нагайну. По плану Волан-де-Морта Барти Крауч-младший должен был обеспечить участие и победу Гарри Поттера в Турнире Трёх Волшебников, превратить Кубок Турнира в портал и доставить мальчишку Тёмному Лорду. Ведь в соответствии с обрядом возрождения надо было сварить зелье, в которое входили бы кровь врага, кость отца и плоть слуги. Врагом, от которого Тёмный Лорд хотел получить кровь, должен был стать Гарри Поттер.\n\n24 июня 1995 года, в день третьего и последнего состязания Турнира Трёх Волшебников, Тёмный Лорд соединил все три элемента и наконец-то возродился, обретя тело. К нему вернулась вся магическая мощь, которую он когда-то потерял. Но радость его была омрачена тем, что Поттер в очередной раз ускользнул от него."],
            ["Подчинение магического сообществ","images_pair/1_3.jpg","Начиная с 1995 года Волан-де-Морт стал подчинять себе магов и склонять к сотрудничеству различных тёмных созданий. Но в первую очередь он решил докопаться до истинного смысла пророчества. Для этого он хотел узнать его полностью, догадываясь, что упустил что-то очень важное. Однако все попытки извлечь запись пророчества из Отдела тайн не увенчались успехом: её мог взять из архива только тот, о ком говорится в пророчестве. То есть либо сам Тёмный Лорд, либо Гарри Поттер. Тогда Волан-де-Морт через имеющуюся с мальчиком связь посылает тому ложные видения, с помощью которых ему удалось заманить Гарри в Отдел тайн, где за нужную запись пророчества началась настоящая битва. Но сражение закончилось для Волан-де-Морта неудачей: пророчество в пылу сражения разбилось, а Пожиратели были арестованы. Более того, министр магии Корнелиус Фадж своими глазами увидел Волан-де-Морта и наконец-то поверил в его возвращение, от чего отрекался весь прошлый год.\n\nВолан-де-Морт сражается с Дамблдором в атриуме Министерства магии\n\nИсподволь Волан-де-Морт укрепляет свои позиции. Для начала он приказал Драко Малфою убить Дамблдора. Кстати, прекрасно понимая, что миссия Малфою-младшему не по плечу. По правде говоря, Дамблдора Тёмный Лорд планировал убить попозже. Сначала «наказать» Драко за невыполненное задание (а на самом деле — наказать его отца за проваленную миссию в Министерстве). А потом поручить это дело Северусу Снеггу. Снегг говорит об этом с Дамблдором ещё в июле 1996 года. Поэтому они договариваются о том, что Дамблдора убьёт Снегг вместо Малфоя. Тем более, что старый директор смертельно болен и к концу учебного года, так или иначе, умрёт.\n\nОбо всём этом Волан-де-Морт не знает: Снегг великолепно играет свою роль двойного агента. Поэтому Тёмный Лорд принимает известие о смерти Дамблдора с удовлетворением.\n\nВ течение года Тёмный Лорд сам и с помощью Пожирателей вербует новых сторонников. Одни — (дементоры и оборотни) — идут к нему сами, других же (великаны) надо обольщать и уговаривать… Некоторые маги примыкают к Волан-де-Морту по своей охоте, других заставляют шантажом, третьих вербуют, предварительно наложив на них заклятие «Империус». В последнем случае самым значимым «приобретением» был крупный министерский чиновник Пий Толстоватый. После переворота в Министерстве магии и убийства министра Скримджера он занимает пост министра магии и по сути становится главой марионеточного правительства."],
            ["Поиски непобедимой волшебной палочки и смерть","images_pair/1_4.jpg","Постоянные неудачи в поединках с Поттером побудили Волан-де-Морта искать волшебную палочку получше. От похищенного мастера Олливандера он узнаёт о том, что его палочка и палочка Поттера — близнецы, и очень неохотно сражаются друг с другом. Но и «взятая напрокат» палочка Люциуса Малфоя не только не смогла убить Поттера, но и была уничтожена в бою неизвестным заклинанием, произвольно выпущенным палочкой Гарри.\n\n\nВолан-де-Морт допрашивает Грин-де-Вальда\n\nПродолжая пытать Олливандера, Волан-де-Морт добывает у него сведения о существовании древней непобедимой Бузинной палочки и начинает усиленно её искать. Он убивает бывших владельцев палочки — Грегоровича и Грин-де-Вальда и, наконец, выйдя на её след, похищает палочку из гробницы Дамблдора.\n\nПри этом Волан-де-Морт не оставляет надежды поймать Гарри Поттера и убить его. Все люди Тёмного Лорда предупреждены: жизнь Поттера принадлежит Хозяину, его убивать нельзя! Несколько раз Пожиратели смерти были очень близки к тому, чтобы доставить Волан-де-Морту Гарри Поттера:\n\nТорфинн Роули и Антонин Долохов чуть было не поймали Гарри Поттера, Рона Уизли и Гермиону Грейнджер в кафе, определив их местоположение с помощью заклятия Табу.\nТакже с помощью Табу егеря взяли в плен Золотое Трио и доставили в поместье Малфоев. Лишь наличие у ребят меча Гриффиндора помешало Беллатрисе Лестрейндж вызвать Волан-де-Морта немедленно. Этого хватило, чтобы ребята устроили побег.\nВ гостиной Когтеврана Алекто Кэрроу поймала Поттера и даже вызвала Волан-де-Морта с помощью Чёрной Метки. Тёмный Лорд был в это время занят, да и ложных вызовов уже накопилось достаточно, поэтому он не стал спешить на зов. Тем более, что приближалась развязка их противостояния.\n\nВолан-де-Морт на магической дуэли с Гарри Поттером\n\nПозже Волан-де-Морт узнал, что пока он выискивал Бузинную палочку, Поттер охотился за его крестражами. Поиски Бузинной палочки Волан-де-Мортом с одной стороны, и не менее активные поиски крестражей Гарри Поттером с другой, привели обе стороны к замку Хогвартс, где между армией Волан-де-Морта и защитниками Школы разгорелась финальная битва. На момент открытого сражения между Поттером и Реддлом все крестражи Тёмного Лорда были уничтожены и юноше удаётся победить самого страшного тёмного мага XX века. Нельзя сказать, что именно Поттер убил Волан-де-Морта, поскольку Тёмный Лорд умер от собственного (правда, отражённого Гарри) заклятия «Авада Кедавра»"]
        ]
    },
    {
        id:2,
        array:[
            ["Начало","images_pair/2_0.jpg","Банда преступников грабит банк в Готэм-Сити, убивая друг друга за большую долю, пока не остается только Джокер (Хит Леджер), который сбегает с деньгами. Бэтмен (Кристиан Бейл), окружной прокурор Харви Дент (Аарон Экхарт) и лейтенант Джим Гордон (Гари Олдман) создают альянс, чтобы избавить Готэм от организованной преступности. Брюс Уэйн впечатлен идеализмом Дента и предлагает поддержать его карьеру; он считает, что с Дентом в качестве защитника Готэма он может отказаться от роли Бэтмена и вести нормальную жизнь с Рэйчел Доус (Мегги Джилленхол), хотя она и Дент встречаются."],
            ["Становление Джокера","images_pair/2_1.jpg","Преступный босс Сал Марони (Эрик Робертс), Гэмбол (Майкл Джей Уайт) и чеченцы проводят видеоконференцию со своим коррумпированным бухгалтером Лао (Чинь Хань), который взял их средства на хранение и сбежал в Гонконг. Вмешивается Джокер, предупреждает их, что Бэтмен охотится за преступниками, и предлагает убить его в обмен на половину их денег. Гэмбол, испытывающий ненависть к Джокеру, объявляет награду за его голову. Вскоре Джокер убивает Гэмбола в его пентхаусе и становится главарем его банды. Бандиты в конечном итоге решают принять предложение."],
            ["Харви Дент вступает на тёмную сторону","images_pair/2_2.jpg","Бэтмен находит Лао в Гонконге и возвращает его в Готэм для дачи показаний, что позволяет Денту задержать всю банду. Джокер угрожает убивать людей, пока Бэтмен не раскроет свою личность, и начинает с убийства комиссара полиции Джиллиан Б. Лоеба (Колин Макфарлейн) и судьи (Патрик Клиар), который председательствует на суде над бандой. Джокер также пытается убить мэра Энтони Гарсиа (Нестор Карбонелл), но Гордон жертвует собой, чтобы предотвратить убийство. Дент узнает, что Рэйчел является следующей целью.\n\nБрюс решает раскрыть свою тайную личность. Однако, прежде чем он это сделает, Дент заявляет, что он и есть Бэтмен. Дент взят под охрану, но появляется Джокер и нападает на конвой. Бэтмен приходит на помощь Денту, и Гордон, который подстроил свою смерть, задерживает Джокера, что обеспечивает ему повышение до комиссара. Рэйчел и Дента сопровождают детективы на зарплате у Марони; позже Гордон узнает, что они не вернулись домой. Бэтмен допрашивает Джокера, который рассказывает, что они находятся в разных местах, начиненных взрывчаткой. Бэтмен мчится, чтобы спасти Рэйчел, а Гордон пытается спасти Дента. Бэтмен прибывает в здание, но понимает, что Джокер отправил его к Денту. Оба здания взрываются, Рэйчел погибла, у Дента изуродована половина лица. Джокер сбегает с Лао, которого он позже убивает вместе с чеченцем (Ричи Костер)."],
            ["Харви Дент решает судьбы","images_pair/2_3.jpg","Коулман Риз (Джошуа Харто), бухгалтер Wayne Enterprises, приходит к выводу, что Брюс это Бэтмен и пытается обнародовать информацию. Не желая, чтобы откровение Риза помешало его планам, Джокер угрожает взорвать больницу, если кто-нибудь не убьет Риза. Гордон приказывает эвакуировать все больницы в Готэме и направляется охранять Риза. Джокер дает Денту оружие и убеждает его отомстить за смерть Рэйчел, затем взрывает больницу и сбегает на автобусе с заложниками. Дент продолжает убивать, он определяет судьбу людей, которых считает ответственными за смерть Рэйчел, подбрасывая свою счастливую монету."],
            ["Люди делают выбор","images_pair/2_4.jpg","После объявления, что Готэм будет подчиняться ему с наступлением ночи, Джокер начиняет два эвакуационных парома взрывчаткой; на одном едут гражданские лица, на другом — заключенные. Он говорит, что взорвет оба парома к полуночи, но оставит один паром целым, если его пассажиры (у которых есть детонатор для другого судна) взорвут другой. Благодаря помощи Люциуса Фокса (Морган Фриман) Бэтмен находит Джокера с помощью сонара, которое шпионит за всем городом. И мирные жители, и заключенные отказываются убивать друг друга, а Бэтмен задерживает Джокера после короткого боя. Прежде чем прибудет полиция, чтобы взять Джокера под стражу, он злорадствует, что граждане Готэма потеряют надежду, как только буйство Дента станет достоянием общественности."],
            ["Финал","images_pair/2_5.jpg","Гордон и Бэтмен прибывают в здание, где погибла Рэйчел. Дент стреляет в Бэтмена, жалеет себя и угрожает убить сына Гордона (Натан Гэмбл), утверждая, что халатность Гордона привела к смерти Рэйчел. Прежде чем он подбросит монету для определения судьбы мальчика, Бэтмен, на котором был бронежилет, сталкивает Дента со здания, в результате тот умирает. Бэтмен убеждает Гордона возложить на него ответственность за убийства и сохранить героический образ Дента. Когда полиция начинает охоту на Бэтмена, Гордон уничтожает Бэт-сигнал, Фокс наблюдает, как устройство сонара самоуничтожается, а Альфред Пенниуорт (Майкл Кейн) сжигает письмо от Рэйчел, в котором говорится, что она планирует выйти замуж за Дента."],
        ]
    },
    {
        id:3,
        array:[
            ["Становление злодея","images_pair/3_0.jpg","В 1989 году Мориарти убил Карла Пауэрса, который, как он утверждал, «смеялся над ним». Он хранил кроссовки Пауэрса почти двадцать лет, пока не использовал их как часть своего плана встречи с Шерлоком Холмсом и оставил их в заброшенной квартире на Бейкер-стрит, 221С.\n\nС тех пор он развил свои навыки в криминальной деятельности и начал создавать крупную преступную организацию, которая распространилась бы по всему земному шару.\n\nМориарти выступал спонсором, информатором и вдохновителем. У него появился интерес к Шерлоку, граничащий с одержимостью, хотя Джеймс без колебаний пытался убить его, когда теряет интерес. В его работе никогда не было прямого контакта между ним и его клиентами."],
            ["Первая встреча","images_pair/3_1.jpg","В конечном итоге Мориарти решает сыграть в «игру» с Шерлоком, заставляя его разгадывать тайны в течение определенного времени и захватывая заложников, чтобы обеспечить правильную мотивацию Шерлока. Он также маскируется под парня Молли Хупер, Джима, и навещает Шерлока в своей лаборатории, когда пытается разгадать загадку. Шерлок, не зная, что он Мориарти, делает вывод, что тот гей (хотя это был заговор Мориарти), что огорчает Молли.\n\nКогда Шерлок разгадал каждую загадку, он наконец встретил Мориарти в бассейне, открыв личность одного из самых опасных преступников. Мориарти взял Джона в заложники, надев на него взрывчатку и подстраховав ситуацию снайпером. В интенсивном противостоянии Мориарти предупредил Шерлока, чтобы тот отступил, сказав: «Я тебе сердце выжгу», если он этого не сделает. Затем Мориарти ушёл, и Шерлок смог снять куртку с взрывчаткой с Джона и отбросить её. Тем не менее, Джеймс вновь появился, говоря, что им нельзя позволить продолжать жить, зная личность Мориарти. В них целились несколько снайперов. Шерлок навёл пистолет на взрывчатку, которую он снял с Джона, намереваясь взорвать её и забрать Мориарти с собой."],
            ["Ирэн Адлер","images_pair/3_2.jpg","Внезапно у криминального гения зазвонил телефон, прерывая их. Мориарти взял трубку и после обмена несколькими фразами ушёл и отозвал снайперов.\n\nОказывается, ему звонила Ирэн Адлер, продавшая ему информацию, содержание которой не раскрывается. Мориарти взамен отправляет «подарок» — Шерлока, — и дает советы о том, как манипулировать «Мальчиками Холмса», дав им обоим прозвища. Также упомянуто, что он ничего не просил взамен, вмешиваясь только, чтобы вызвать проблемы, предполагая, что его навязчивые идеи углубляются."],
            ["Рейхенбахский водопад","images_pair/3_3.jpg","Позже Мориарти видят за пределами Лондонского Тауэра, одетого в обычную одежду, и, войдя в комнату, где хранятся драгоценности Короны, он надевает наушники и начинает слушать «Сороку-воровку» Россини. Достав свой андроид Incredible S, Мориарти нажал на иконку с эмблемой короны Англии. Отсюда видно, что Банк Англии, тюрьма в Пентовиле и системы безопасности Лондонского Тауэра были взломаны одновременно.\n\nКогда лондонские полицейские силы, в том числе Лестрейд и Салли Донован, поспешно ехали к этим местам, в комнате, где находился Мориарти, сработала сигнализация. Охранники приказали всем уйти, и вся комната освободилась от посетителей и охранников. Когда дверь закрывалась, охранник просил Мориарти уйти, но прежде чем тот успел закончить предложение, Мориарти распыляет на него баллончик с усыпляющим газом. Разбив стеклянную витрину вокруг драгоценностей Короны, он надел их и стал ждать, пока полиция арестует его.\n\nНад ним состоялся суд присяжных, в котором Шерлок был главным свидетелем, но Джеймса отпустили, не найдя прямых доказательств. Мориарти зашёл к Холмсу на Бейкер-стрит и, оставив ложную подсказку, ушёл, бросив фразу: «Я твой должник».\n\nПозже Шерлок и Джон расследовали исчезновение из частной школы в Лондоне сына и дочь посла США. Было известно, что их похитили в последний день школьного семестра. Таким образом, похитителю, посланному Мориарти, было невероятно легко слиться с толпой из многочисленных родителей и детей и незамеченным войти в школу.\n\nДождавшись наступления темноты, похититель направился к комнате, где спали дети, вооружившись пистолетом. В результате того, что он провел бóльшую часть своей школьной жизни в частном интернате, сын посла знал тени всех людей, которые проходили мимо двери и, почувствовав неладное, оставил ключ для полиции. Схватив двух детей,  держал их под дулом пистолета и вывел из школы. Оттуда он доставил их на заброшенный склад в Аддлстоне. Затем похититель запер испуганных детей в клетке в холодной тёмной комнате. Клетка была наполнена сотнями сладостей. Обертки сладостей были покрыты смертельным ядом (ртутью), который постепенно убивал детей.\n\nЧеловек Мориарти, очень похожий на Шерлока, травмировал девочку, поэтому, встретив настоящего Шерлока, она закричала и испугалась его, что должно было убедить инспектора Лестрейда, что тот был потенциальным похитителем. Затем его начальник приказал арестовать Шерлока за похищение и Джона за то, что он ударил начальника Лестрейда по лицу.\n\nПосле побега из полиции Шерлок и Джон стали беглецами. После того, как Шерлок и Джон проникли в дом журналистки Китти Рейли, которую младший Холмс встретил перед заседанием суда Мориарти, и обнаружили там скрывавшегося Джеймса. Испуганный и дрожащий от страха, он говорит Шерлоку и Джону держаться подальше от него и умоляет Джона не причинять ему боль.\n\nКитти утверждала, что никогда не было человека по имени Джеймс Мориарти, и обвинила Шерлока в его создании, а также во всех раскрытых им преступлениях, которые он совершил якобы для того, чтобы стать популярным в средствах массовой информации и создать себе репутацию частного детектива. Джон отказывался верить в это, утверждая, что Мориарти только недавно предстал перед судом за попытку кражи со взломом, и что от намеревался взорвать его самого и Шерлока. Рейли возразила, сказав, что Мориарти на самом деле был актером по имени Ричард Брук, которому Шерлок заплатил, чтобы выставить в роли главного злодея. По-прежнему отрицая это, Джон попросил показать доказательства. Китти показывает ему многочисленные статьи о Ричарде Бруке, включая различные деловые фотографии. Затем Мориарти утверждает, что играет роль рассказчика для маленьких детей на телевидении. Шерлок кричит на Мориарти, требуя, чтобы он прекратил эту ложь. Наступая на него, Шерлок и Джон кинулись за Мориарти, и тот сбежал через ближайшее окно.\n\nПозже, в больнице Святого Варфоломея, Шерлок пишет Мориарти, с которым встречается на крыше. Шерлок утверждает, что с помощью кода он может полностью удалить все свидетельства существования Ричарда Брука из мира. Мориарти говорит, что кода нет, и ритм постукивания, который Шерлок принял за двоичный код, на самом деле был ритмом скрипичной партиты Баха № 1. Мориарти сказал Шерлоку, что его слабость в том, что он всегда хочет, чтобы все было разумно и сложно, поэтому он может решить это и похвастаться своим интеллектом перед другими.\n\nМориарти объясняет, что за последние сутки он убедил широкую публику, что Шерлок Холмс — мошенник и лжец, поэтому однажды великая репутация Шерлока была полностью разрушена, и единственным человеком, который все еще доверял ему, был Джон. Когда Шерлок спросил, как Джеймсу удалось проникнуть в тюрьму, банк и Тауэр, Мориарти ответил, что он просто подкупил охранников, чтобы они сотрудничали с ним в его схеме.\n\nПоследний план Мориарти состоял в том, чтобы довести Шерлока до такой степени, что он совершит самоубийство, чтобы избежать своей разрушенной жизни, но, поскольку Шерлок не хотел этого делать, Мориарти объяснил, что он нанял трех убийц, стратегически расположенных в Лондоне, каждый из которых был готов застрелить трех настоящих друзей Шерлока: Лестрейда, миссис Хадсон и Джона. Один был замаскирован под полицейского возле офиса инспектора Лестрейда, другой был ремонтником в квартире на Бейкер-стрит, а последний находился в здании башни напротив больницы Бартса.\n\nОднако Шерлок выяснил, что существует слово, которое только Мориарти мог сказать, и это отзовет убийц. Затем Шерлок и Мориарти беседовали друг с другом. Джеймс сказал, что разочарован в Шерлоке, что он такой же обычный как остальные люди и находился «на стороне ангелов». Тот заявил, что Мориарти не должен предполагать, что он один из них по существу, намекая, что у него тоже есть тёмная сторона.\n\nПризнав, что он и Шерлок похожи, Мориарти сказал, что пока он жив, друзья Шерлока также будут в безопасности. После он пожал руку Холмсу и, достав пистолет, засунул дуло в рот и выстрелил."]
        ]
    },
    {
        id:4,
        array:[
            ["Битва за Титан","images_pair/4_0.jpg","Титан Танос прибыл на планету Титан, и он увидел Доктора Стрэнджа, который сидел и ждал его. Когда Танос спросил Стрэнджа, что это за место, Стрэндж сказал, что это его дом. После он использовал камень реальности и показал ему иллюзию бывшего Титана и рассказал его историю о его разрушении. После началась битва между Мстителями, Стражами Галактики и Стрэнджем против Таноса. Во время битвы, к Стражам и Мстителям присоединилась Небула. После Мантис подчинила себе Таноса, но Небула сказала Питеру Квиллу, что Танос грустит из-за смерти Гаморы, тогда Квилл ударил его, но Танос проснулся и оглушил всех.\n\n\nТанос уничтожает луну Титана.\n\nТогда Танос использовал камни силы и пространства, чтобы сломать часть Луны и притянуть их, а после направить на героев, чтобы убить их. Пока Железный человек был оглушён частями Луны, Доктор Стрэндж единственный сражался против Таноса, но всё же он проиграл ему. Тогда очнулся Железный человек, и он последний, кто сражался против Таноса. Старку даже удалось поцарапать Таноса, но Танос сломал его нож и ранил его им. Тогда Стрэндж решил отдать ему камень времени, ради жизни Тони, тогда Танос покинул Титан и отправился в Ваканду."],
            ["Гибель половины","images_pair/4_1.jpg","Когда Танос смог забрать у Вижена камень разума и положить его в перчатку бесконечности, он щёлкнул пальцами, убив половину Вселенной. Когда половина Вселенной стала пропадать, на Титане погибли все, кроме Небулы и Тони Старк, а они остались там, оплакивая супергероев."],
            ["Надежда","images_pair/4_2.jpg","В 2023 году, через пять лет после децимацию Мстители решают устроить 'Хрононалёт' - план, где каждый Мститель отправлялся в прошлое, чтобы забрать отсюда камень бесконечности, а после возвращается обратно. Тогда они собирают все камни, кладут в перчатку и щёлкают пальцами, воскрешая всех погибших при децимации. Когда Мстители путешествовали в 2014 году, альтернативный Танос узнал, что Мстители из будущего пытаются отменить децимацию Таноса из будущего. Полностью уверенный в том, что выжившая половина вселенной недовольна этому поступку, он решает отправится в будущее и уничтожить эту вселенную, чтобы создать новую.\n\n\nКапитан Америка сражается против Таноса с помощью Мьёльнира.\n\nПосле отмена децимации, альтернативная Небула активировала машину времени Мстителей, из-за чего Танос с Чёрным орденом Гаморой и остальной армией отправляется в 2023 год, разрушая новую базу Мстителей. Капитан Америка, Железный человек и Тор прибыли к Таносу, чтобы сразиться с ним. Во время битвы, Роджерс становится достоин. чтобы поднять Мьёльнир, тогда он наносит им сильные удары Таносу. Однако, сражение заканчивается в пользу титана, которому удалось одолеть всю тройку.\n\n\nМстители приготовились к бою.\n\nКогда Стив Роджерс собирался сражаться против армии Таноса, он слышит голос Сэма Уилсона, который говорит, что он слева. Затем открываются порталы, созданный магами, из которых выходили: Ваканда, Стражи Галактики, Опустошители, Валькирии, Асгардцы и Дора Милаж. Также прибыли герои, которые временно были убиты Таносом, Доктор Стрэндж, Чёрная пантера, Человек-паук, Звёздный Лорд, Оса, Дракс Разрушитель, Мантис, Грут, Алая ведьма, Сокол и Зимний солдат. Также прибыли герои, которые не были убиты Таносом: Пеппер Поттс, надевшую броню Спасительницы, М'Баку, Окойе, Вонг, Валькирия, Корг, Миек, Говард Утка, Краглин Обфонтери и Гамора из альтернативной версии. Обе стороны выстроились в строй, пока Капитан Америка не дал команду к бою."],
            ["Реванш","images_pair/4_3.jpg","Танос забирает и надевает перчатку на руку, но вступает в схватку с Капитан Марвел, Танос пытался оглушить её ударом головой, но ей ничего не было. Тогда Танос вытаскивает из перчати камень силы и наносит сильный удар Капитан Марвел, оглушив её. Железный человек просыпается и отводит свой взгляд на Доктора Стрэнджа, который показывает ему один палец, намекая, что это тот их победный шанс.\n\n\nСтарк щёлкает пальцами, используя силу камней бесконечности.\n\nКогда Танос вновь надевает перчатку и уже приготовился щёлкать пальцами, ослабленный Железный человек нападает на Таноса, но тот его отталкивает. Теперь, называя себя неотвратимостью, Танос щёлкает пальцами, но ничего не происходит. Камни из перчатки переместились в броню Старка. Сказав, что он Железный человек, Старк щёлкнул пальцами."],
        ]
    },
    {
        id:5,
        array:[
            ["Появление","images_pair/5_0.jpg","Смит был создан в качестве лидера первых агентов. Роль Смита, как и других агентов, заключалась в том, чтобы охранять и поддерживать порядок в Матрице, устраняя потенциальные угрозы для стабильности системы, такие как разбуженные люди и дефектные программы. \nAgent Smith\nАгент Смит во время допроса Морфеуса\n\nВпервые он появляется вместе с агентом Брауном в погоне за Тринити. После этого он получает приказ взять компьютерного хакера Нео. После непродолжительного допроса, в котором Смит предлагал Нео сдать агентам Морфеуса, он поставил Томасу жучок и отпустил домой.\nАгент Смит был использован в качестве примера в Программе уклонения от агентов, в которой тренировался Нео.\n\nНемного позже, Смит заключил сделку с Сайфером, который ненавидел Морфеуса. Он должен был подставить его, и отдать агентам. Когда команда «Навуходоносора» направилась к предсказательнице Оракулу, то Сайфер сообщил их координаты. В результате, Морфеус был захвачен Смитом, а половина команды уничтожена.\n\nAgent-Smith-in-The-Matrix\nПервая смерть Агента Смита\n\nАгенты Браун и Смит стали выпытывать у Морфеуса код доступа к главному компьютеру Зиона, но тот изо всех сил сопротивлялся. Неожиданно перед зданием, где находился штаб агентов, появился вертолёт, на котором находились Нео и Тринити. Они временно убили агентов и освободили лидера.\nКогда Морфеус, Нео и Тринити собрались выходить из Матрицы, их настиг Смит и не дал избранному вернуться в реальный мир, прострелив телефонную трубку. Нео пришлось вступить в бой с агентом. После тяжелейшей схватки, Нео удалось сбросить противника под поезд и убежать, однако, возле другого телефона, его настиг Смит с подчинёнными и застрелил. Но Нео не погиб, а наоборот, обрёл новые способности и остановил пули, выпущенные из пистолетов агентов. После этого Нео легко разрушил программный код агента, тем самым убив его."],
            ["Неожиданное возвращение","images_pair/5_1.jpg","Агент Смит, казалось, был уничтожен Нео, но вскоре он вернулся с необычными способностями и мотивациями, а также перестал идентифицироваться всеми системами как агент. Его внешний вид тоже изменился, он стал носить более угловатые очки и черный костюм, а не типичный темно-зеленый с прямоугольными очками, который носили обычные агенты. Смит также лишился характерной динамики, присущей агентам, показывая, что он теперь 'освобождённый', но не был Изгоем. Смит также смог создавать свои копии, превращая в них всех, кто находился в Матрице, тем самым став компьютерным вирусом.\nВ результате этого Смит начал проявлять сильные, более опасные человеческие поведения и эмоции, такие, как непредсказуемость и сухой юмор, что является явным отходом от его первоначального поведения, характерного сухим и расчётливым 'слугам Системы'. Он начал понимать, что виновником его возрождения и становления свободной программой стал Нео, который случайно перекодировал его во время последнего боя. Смит в виде вируса стал представлять опасность как для людей, так и для машин. Поэтому он стал 'падшим агентом'."],
            ["Смит везде","images_pair/5_2.jpg","Спустя некоторое время, после возрождения, Смит заразил собой одного из жителей Зиона, Бэйна, тем самым получив тело в реальном мире. Позже оно было уничтожено Нео на борту «Логоса».\nПосле заражения Бэйна, Смит со своими двойниками пытался уничтожить Нео в Матрице, но избранный, поняв, что не осилит стольких врагов, сумел уйти от них.\n\nПостепенно Смит заполонил всю Матрицу, в том числе и предсказательницу Оракула, тем самым узнав то, что та видела в будущем."],
            ["Исход","images_pair/5_3.jpg","Ближе к концу третьего фильма, Нео в последний раз встречается со Смитом, который был создан из Оракула и начинает с ним бой, в котором не участвуют его остальные копии из-за уверенности в победе.\nВскоре, Смит побеждает Нео и тот падает на землю. Смит собирается его добить, но тут вспоминает про пророчество.\nВ конце концов Нео сделал выбор, позволив Смиту поглотить его. Но бывший агент совершил большую ошибку — Нео был подключён к главному компьютеру машин, и когда он пропустил мощный поток энергии через тело избранного, то удалил Смита-Нео и всех его копий."],        ]
    },
    {
        id:6,
        array:[
            ["Песочный человек","images_pair/6_0.jpg","Прошло пять лет с тех пор, как Питер Паркер осознал, что с большой силой приходит большая ответственность. Кажется, Питер научился жить несколькими жизнями: он хорошо учится, Нью-Йорк признал его героем, Питер даже намеревается сделать Мэри Джейн предложение руки и сердца.\n\nНо его лучший друг Гарри Озборн по-прежнему считает, что именно Человек-Паук несёт ответственность за преждевременную кончину его отца. Гарри намеревается отомстить ему в образе Гоблина-Младшего. Создав костюм и глайдер, он решает напасть на Питера. В результате стычки на улицах Нью-Йорка, Гарри получает от Питера серьёзное ранение, которое приводит к потере памяти. Гарри помнит лишь то, что его отец мёртв. В то же самое время из Нью-Йоркской тюрьмы сбегает преступник Флинт Марко. Скрываясь от полиции, Флинт волею случая оказывается на испытательном полигоне института физики как раз в момент запуска экспериментального устройства, которое изменяет его ДНК, превращая в суперзлодея Песочного Человека. В полицейском участке Питеру и его тёте Мэй рассказывают, что Флинт Марко был настоящим убийцей дяди Бена, а Кэррадайн (бандит, ответственный за ограбление клуба, где в роковую ночь выступал Питер) был лишь сообщником."],
            ["Становление зла","images_pair/6_1.jpg","Тем временем у Питера и Мэри Джейн начинаются проблемы. Последнюю увольняют из театра, а у Паркера на работе появляется конкурент — Эдди Брок. Вдобавок ко всему этому, Питера прилюдно целует Гвен Стейси, которую он спас во время крушения здания. Это будит в Мэри Джейн ревность и недоверие, и она уходит из ресторана как раз перед тем, как Питер собирался сделать ей предложение руки и сердца. Вдобавок ещё и Осборну-Младшему возвращается память. Он шантажирует Мэри Джейн, и та, в ответ на предложение Питера выйти за него замуж, говорит, что у неё есть другой. Гарри сообщает Питеру, что другой — это он.\n\nИ вот ночью, когда Питер лёг спать, таинственная чёрная слизь, которая прицепилась к мопеду Питера во время одной из поездок, окутала его. Очнулся он на стене здания и увидел, что был облачён в чёрный костюм. Он почувствовал в себе великую силу и сильное желание отомстить всем своим обидчикам."],
            ["Бар","images_pair/6_2.jpg","Сперва Питер наведывается к Озборну и жестоко калечит его. Потом он едва не убивает Флинта Марко, выплеснув на него мощную струю воды. Далее он обнаруживает, что Эдди сделал снимки чёрного Человека-Паука и занял место фотографа в штате. Паркер унижает Брока, доказав, что его фото — подделка. Вдобавок, он злится на Мэри и идёт с Гвен в клуб, куда Мэри Джейн устроилась на работу. Там он показательно танцует с Гвен и, в ходе стычки с охраной, бьёт Мэри по лицу."],
            ["Появление Венома","images_pair/6_3.jpg","Осознав, что он натворил, Человек-Паук наведывается в церковь. Звон колокола раздражает симбиота, пробудившего в Паркере агрессию. Симбиот нападает на Эдди Брока, волею случая оказавшегося в той же церкви, дабы попросить у Господа смерти Питера, и поглощает его. Эдди становится Веномом. Он заключает союз с Песочным Человеком и похищает Мэри Джейн, чтобы использовать её, как приманку для Человека-паука."],
            ["Финал","images_pair/6_4.jpg","Человек-паук понимает, что не справится с Песочным Человеком и Веномом в одиночку, и просит Гарри о помощи. Но тот, демонстрируя последствия их последней стычки (шрамы на лице), его прогоняет. И тут выясняется, что дворецкий Бернард всё это время знал, что Норман Озборн случайно убил себя сам собственным глайдером. В итоге, после некоторых колебаний Гарри приходит на помощь другу, когда тот был уже на грани гибели. Вместе они побеждают Песочного Человека, и спасают Мэри Джейн от гибели, а затем Человек-Паук побеждает Венома, используя титановые трубы, а затем взорвав его бомбой Гарри. Но при этом Веном убивает последнего, который ценой своей жизни спас жизнь Питеру. Песочный Человек объясняет Питеру, что убил дядю Бена случайно, и не хотел этого. Питер его прощает, после чего Флинт уходит, растворившись на ветру вихрем песчинок. Завершают кино-комикс похороны Гарри, и молчаливый танец Питера с Мэри Джейн, крепко обнимающих друг друга."],
        ]
    }
]

let noveltyList = [
    {
        name:"Ведьмы",
        src:"https://www.youtube.com/embed/rOZfcoUhCG0"
    },
    {
        name:"Гренландия",
        src:"https://www.youtube.com/embed/sZBM492Ufco"
    },
    {
        name:"Криминальный боссы",
        src:"https://www.youtube.com/embed/Jc_Xh7DKbS0"
    },
    {
        name:"Инсомния",
        src:"https://www.youtube.com/embed/lqgxCZj4lz8"
    },
    {
        name:"Самоизоляция",
        src:"https://www.youtube.com/embed/r6nugTIcFI0"
    },
    {
        name:"Лунолет Сурикат",
        src:"https://www.youtube.com/embed/xVTzxDNtgM8"
    },
    {
        name:"Довод",
        src:"https://www.youtube.com/embed/C6dZA-buNCw"
    },
]